src/bsl/InformationRegisters/гкс_ВнешниеПробы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_ВнешниеПробы</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВесБрутто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВесТары</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВесНетто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоказателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящиеДанные</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ВходящиеДанныеWarehouse</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВидПробы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_НазначенияИспользованияКачества</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПогрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПробы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИДКомпозитнойПробы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИДПробы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоИнспекции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Показатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ПоказателиКачестваWarehouse</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Продукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ПродукцияWarehouse</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтанцияНазначения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_КлассификаторСтанцийЖД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтанцияОтправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_КлассификаторСтанцийЖД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сюрвейер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Элеватор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_ВнешниеПробы/Ext/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура добавляет запись в регистр по переданным значениям структуры.
Процедура ДобавитьЗапись(Запись, Загрузка = Ложь) Экспорт

    гкс_ОбменДаннымиСервер.ДобавитьЗаписьВРегистрСведений(Запись, "гкс_ВнешниеПробы", Загрузка);

КонецПроцедуры

// Создает структуру, содержащую имена и значения измерений, ресурсов и реквизитов регистра сведений.
//
// Возвращаемое значение:
//  Структура - коллекция измерений ресурсов и реквизитов.
//
Функция СтруктураЗаписи() Экспорт

	Возврат ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(СоздатьМенеджерЗаписи(),
								Метаданные.РегистрыСведений.гкс_ВнешниеПробы);

КонецФункции

// Процедура удаляет набор записей в регистре по переданным значениям структуры.
Процедура УдалитьЗапись(СтруктураЗаписи, Загрузка = Ложь) Экспорт

	гкс_ОбменДаннымиСервер.УдалитьНаборЗаписейВРегистреСведений(СтруктураЗаписи, "гкс_ВнешниеПробы", Загрузка);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИнициализироватьТаблицуВнешнейПробы() Экспорт

	ТипДата 					= Новый ОписаниеТипов("Дата");
	ТипЧисло					= Новый ОписаниеТипов("Число");
	ТипСтрока 					= Новый ОписаниеТипов("Строка");
	ТипВидПробы 				= Новый ОписаниеТипов("ПеречислениеСсылка.гкс_НазначенияИспользованияКачества");
	ТипПродукция 				= Новый ОписаниеТипов("СправочникСсылка.гкс_ПродукцияWarehouse");
	ТипПоказатель 				= Новый ОписаниеТипов("СправочникСсылка.гкс_ПоказателиКачестваWarehouse");
	ТипОрганизация              = Новый ОписаниеТипов("СправочникСсылка.Организации");
	ТипКонтрагенты 				= Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
	ТипТочкиМаршрута 			= Новый ОписаниеТипов("СправочникСсылка.гкс_ТочкиМаршрута");
	ТипТранспортныеСредства 	= Новый ОписаниеТипов("СправочникСсылка.ТранспортныеСредства");
	ТипКлассификаторСтанцийЖД 	= Новый ОписаниеТипов("СправочникСсылка.гкс_КлассификаторСтанцийЖД");
	ТипВходящиеДанныеWarehouse 	= Новый ОписаниеТипов("СправочникСсылка.гкс_ВходящиеДанныеWarehouse");

	ТаблицаВнешниеПробы = Новый ТаблицаЗначений;
	// Значения шапки
	ТаблицаВнешниеПробы.Колонки.Добавить("Период",					ТипДата);
	ТаблицаВнешниеПробы.Колонки.Добавить("ВидПробы",				ТипВидПробы);
	ТаблицаВнешниеПробы.Колонки.Добавить("ДатаПробы",				ТипДата);
	ТаблицаВнешниеПробы.Колонки.Добавить("ДатаПогрузки", 			ТипДата);
	ТаблицаВнешниеПробы.Колонки.Добавить("ДатаИзменения", 			ТипДата);
	ТаблицаВнешниеПробы.Колонки.Добавить("ИДКомпозитнойПробы", 		ТипСтрока);
	ТаблицаВнешниеПробы.Колонки.Добавить("ИДПробы", 				ТипСтрока);
	ТаблицаВнешниеПробы.Колонки.Добавить("Комментарий", 			ТипСтрока);
	ТаблицаВнешниеПробы.Колонки.Добавить("МестоИнспекции", 			ТипСтрока);
	ТаблицаВнешниеПробы.Колонки.Добавить("НомерДокумента", 			ТипСтрока);
	ТаблицаВнешниеПробы.Колонки.Добавить("НомерЗаявки", 			ТипСтрока);
	ТаблицаВнешниеПробы.Колонки.Добавить("ВходящиеДанные", 			ТипВходящиеДанныеWarehouse);
	// Значение справочные
	ТаблицаВнешниеПробы.Колонки.Добавить("СтанцияОтправления", 		ТипКлассификаторСтанцийЖД);
	ТаблицаВнешниеПробы.Колонки.Добавить("СтанцияНазначения", 		ТипКлассификаторСтанцийЖД);
	ТаблицаВнешниеПробы.Колонки.Добавить("Сюрвейер", 				ТипКонтрагенты);
	ТаблицаВнешниеПробы.Колонки.Добавить("Элеватор", 				ТипТочкиМаршрута);
	ТаблицаВнешниеПробы.Колонки.Добавить("НомерТС", 				ТипСтрока);
	ТаблицаВнешниеПробы.Колонки.Добавить("ТранспортноеСредство", 	ТипТранспортныеСредства);
	ТаблицаВнешниеПробы.Колонки.Добавить("Показатель", 				ТипПоказатель);
	ТаблицаВнешниеПробы.Колонки.Добавить("Продукция", 				ТипПродукция);
	ТаблицаВнешниеПробы.Колонки.Добавить("Организация", 			ТипОрганизация);
	// Значение показателей
	ТаблицаВнешниеПробы.Колонки.Добавить("ВесБрутто", 				ТипЧисло);
	ТаблицаВнешниеПробы.Колонки.Добавить("ВесТары", 				ТипЧисло);
	ТаблицаВнешниеПробы.Колонки.Добавить("ВесНетто", 				ТипЧисло);
	ТаблицаВнешниеПробы.Колонки.Добавить("ЗначениеПоказателя", 		ТипЧисло);

	Возврат ТаблицаВнешниеПробы;

КонецФункции

Функция ВнешниеПробыПоВходящимДанным(ВходящиеДанные) Экспорт

	Запрос 		 = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВнешниеПробы.ВидПробы КАК ВидПробы,
	|	ВнешниеПробы.ДатаИзменения КАК ДатаИзменения,
	|	ВнешниеПробы.ДатаПогрузки КАК ДатаПогрузки,
	|	ВнешниеПробы.ДатаПробы КАК ДатаПробы,
	|	ВнешниеПробы.ИДКомпозитнойПробы КАК ИДКомпозитнойПробы,
	|	ВнешниеПробы.ИДПробы КАК ИДПробы,
	|	ВнешниеПробы.Комментарий КАК Комментарий,
	|	ВнешниеПробы.МестоИнспекции КАК МестоИнспекции,
	|	ВнешниеПробы.Продукция КАК Продукция,
	|	ВнешниеПробы.НомерДокумента КАК НомерДокумента,
	|	ВнешниеПробы.НомерЗаявки КАК НомерЗаявки,
	|	ВнешниеПробы.НомерТС КАК НомерТС,
	|	ВнешниеПробы.Организация КАК Организация,
	|	ВнешниеПробы.Показатель КАК Показатель,
	|	ВнешниеПробы.СтанцияНазначения КАК СтанцияНазначения,
	|	ВнешниеПробы.СтанцияОтправления КАК СтанцияОтправления,
	|	ВнешниеПробы.Сюрвейер КАК Сюрвейер,
	|	ВнешниеПробы.ТранспортноеСредство КАК ТранспортноеСредство,
	|	ВнешниеПробы.Элеватор КАК Элеватор,
	|	ВнешниеПробы.ВесБрутто КАК ВесБрутто,
	|	ВнешниеПробы.ВесТары КАК ВесТары,
	|	ВнешниеПробы.ВесНетто КАК ВесНетто,
	|	ВнешниеПробы.ЗначениеПоказателя КАК ЗначениеПоказателя
	|ИЗ
	|	РегистрСведений.гкс_ВнешниеПробы КАК ВнешниеПробы
	|ГДЕ
	|	ВнешниеПробы.ВходящиеДанные = &ВходящиеДанные";

	Запрос.УстановитьПараметр("ВходящиеДанные", ВходящиеДанные);

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

#КонецОбласти

#КонецЕсли
